package models
{
	public class AchieveVO
	{
		public function AchieveVO()
		{
		}
		
		public static const achieveList:Array = [
			//成就名称、说明
			["虚心好学", "将所有房间点击一遍"],
			["初出茅庐", "找到皇帝房间"],
			["仪容得体", "换装成功"],
			["日新月异", "完成又日新牌匾游戏"],
			["巧夺天工", "完成钟表拨动"],
			["驾轻就熟", "完成探索皇帝寝室"],
			["不忘祖训", "找到圣训"],
			["火眼金睛", "收集婴戏图"],
			["开疆辟土", "完成地图拼图简单模式"],
			["精益求精", "完成地图拼图困难模式"],
			["知书达礼", "点击所有文具"],
			["学贯中西", "完成温度计游戏"],
//			["飞龙在天", "完成三棱镜游戏"],
//			["高瞻远瞩", "望远镜中找到小狮子"],
//			["耳目一新", "读膳单"],
//			["任贤用能", "点击御厨"],
//			["才高八斗", "完成吉祥膳名简单模式"],
//			["学富五车", "完成吉祥膳名困难模式"],
//			["谨小慎微", "完成银牌试毒游戏"],
//			["知人善任", "翻膳牌"],
//			["体恤民情", "赏膳给百姓"],
//			["勤政爱民", "御门听政"],
//			["奏折1", "励精图治"],
//			["奏折2", "明察秋毫"],
//			["机智过人", "七巧板简单"],
//			["博古通今", "七巧板困难"],
//			["兴高采烈", "所有交互"],
//			["心花怒放", "戏台所有交互"],
//			["眼疾手快", "完成面具简单"],
//			["身手不凡", "面具困难"]
		];
	}
}