package models
{

	public class AchieveVO
	{
		public function AchieveVO()
		{
		}

		public static const achieveList:Array=[
			//成就名称、说明
			["虚心好学", "将养心殿后殿的所有房间都点击一遍"],	//0
			["初出茅庐", "找到皇帝寝室"],		//1
			["仪容得体", "换装成功"],		//2
			["日新月异", "完成又日新牌匾游戏"],	//3
			["武艺超群", "完成骑射游戏"],		//4
			/*["驾轻就熟", "完成探索皇帝寝室"]*/,//5
			["不忘祖训", "找到“圣训”和“实录”"],		//6
			["火眼金睛", "婴戏图上面完成“找一找”小游戏"],		//7
			/*["开疆辟土", "完成拼图简单模式"]*/,//8
			/*["精益求精", "完成拼图困难模式"]*/,//9
			["知书达礼", "点击书桌上的文房四宝"],		//10
			["学贯中西", "完成温度计游戏"],	//11
			["飞龙在天", "在三棱镜中照亮九条龙"],	//12
			["高瞻远瞩", "望远镜最清晰状态下，找到小狮子"],//13
			["纵横四海", "御膳房读进贡单"],	//14
			["任贤用能", "点击御厨"],		//15
			["才高八斗", "完成吉祥膳名简单模式"],//16
			["学富五车", "完成吉祥膳名困难模式"],//17
			["谨小慎微", "完成银牌试毒游戏"],	//18
			["知人善任", "翻膳牌"],			//19
			["体恤民情", "赏膳给百姓"],		//20
			["勤政爱民", "完成御门听政流程"],		//21
			/*["励精图治", "奏折1"]*/,			//22
			["明察秋毫", "批阅两个奏折"],			//23
			/*["机智过人", "七巧板简单"]*/,		//24
			/*["博古通今", "七巧板困难"]*/,		//25
			["兴高采烈", "控制西游记舞台上面的所有角色"],		//26
			["心花怒放", "控制三国舞台上面的所有角色"],		//27
			["本领高强", "完成西游记游戏"],		//28
			["神机妙算", "完成三国游戏"],		//29
			["眼疾手快", "收集到所有小鸟"],		//30
			["勤奋好学", "翻看每一页手册内容"],		//31
			["博古通今", "翻看每一件文物介绍"],		//32
			["赫赫有名", "获得所有成就"]		//33
		];
	}
}
