package models
{

	public class AchieveVO
	{
		public function AchieveVO()
		{
		}

		public static const achieveList:Array=[
			//成就名称、说明
			["虚心好学", "将所有房间点击一遍"],	//0
			["初出茅庐", "找到皇帝房间"],		//1
			["仪容得体", "换装成功"],		//2
			["日新月异", "完成又日新牌匾游戏"],	//3
			["巧夺天工", "完成钟表拨动"],		//4
			/*["驾轻就熟", "完成探索皇帝寝室"]*/,//5
			["不忘祖训", "找到圣训"],		//6
			["火眼金睛", "收集婴戏图"],		//7
			["开疆辟土", "完成地图拼图简单模式"],//8
			["精益求精", "完成地图拼图困难模式"],//9
			["知书达礼", "点击所有文具"],		//10
			["学贯中西", "完成温度计游戏"],	//11
			["飞龙在天", "让九条龙完全显形"],	//12
			["高瞻远瞩", "望远镜中找到小狮子"],//13
			["纵横四海", "御膳房读进贡单"],	//14
			["任贤用能", "点击御厨"],		//15
			["才高八斗", "完成吉祥膳名简单模式"],//16
			["学富五车", "完成吉祥膳名困难模式"],//17
			["谨小慎微", "完成银牌试毒游戏"],	//18
			["知人善任", "翻膳牌"],			//19
			["体恤民情", "赏膳给百姓"],		//20
			["勤政爱民", "御门听政"],		//21
			["励精图治", "奏折1"],			//22
			["明察秋毫", "奏折2"],			//23
			/*["机智过人", "七巧板简单"]*/,		//24
			/*["博古通今", "七巧板困难"]*/,		//25
			["兴高采烈", "所有交互"],		//26
			["心花怒放", "戏台所有交互"],		//27
			["眼疾手快", "完成面具简单"],		//28
			["神机妙算", "完成三国面具"]		//29
		];
	}
}
